/*
var textNodes = $('.article .j-text').find(":not(iframe)").addBack().contents().filter(function() {
	return this.nodeType == 3;
});
*/


/*
var articleText = '';
$('.article .j-text').contents().each(function(){
	articleText += ($(this).text()) + '_';
});

var arrayOfStrings = articleText.split(/[.?!_]/);
*/

var arrayOfStrings = ["Считаете, что все знаменитости с детства стремились к славе", " На самом деле, некоторым из них просто повезло оказаться в нужном месте в нужное время", " Мы собрали несколько историй о голливудских небожителях, которые и не помышляли о том, чтобы стать кумирами миллионов", " ", " ", "Эванджелин Лилли ", "", "Исполнительница одной из главных ролей в сериале «Остаться в живых» Эванджелин Лилли даже и не помышляла об актерской карьере - она работала стюардессой в авиакомпании Air Canda, еще и обслуживая на полставки посетителей в одном из кафе", " Судьба настигла ее, когда она однажды возвращалась с работы домой - на улице ее заметил рекрутер модельного агентства", " После пары эпизодических ролей ей и предложили сыграть Кейт Остин в ставшем культовым сериале", " Кстати, и здесь сначала не все шло гладко - Эванджелин долго не могла получить визу в США, поэтому авторы шоу уже начали искать ей замену, но к счастью, все обошлось", "", "", " ", "Памела Андерсон", "", "Знаменитая спасательница Малибу Памела Андерсон начинала карьеру как фитнес-инструктор в родном Ванкувере", " В то же время одна из фирм по производству пива завербовала юную красотку в качестве промо-модели", " Минута славы для Андерсон настала, когда она в облегающей футболке с логотипом пивной компании пришла на матч Канадской футбольной лиги", " Во время одной из пауз в игре оператор вывел изображение Памелы на большой экран, чем вызвал восторг у публики", " Предложения о съемках для мужских журналов не заставили себя долго ждать", "", " ", "Джейсон Стэтхэм", "", "Джейсон Стэтхэм тоже не сразу пришел к амплуа брутального героя", " Большинство поклонников английского актера знают, что он долгое время был профессиональным спортсменом и даже 12 лет входил в состав британской национальной сборной по прыжкам в воду", " Более того, Стэтхэм участвовал в олимпийских играх", " Но сам он в интервью не раз говорил, что спорт был для него скорее хобби, а вот деньги он зарабатывал продажей парфюмерии и украшений на улицах Лондона, что было не совсем легально", " Но именно впечатляющие презентационные навыки Джейсона и вдохновили сотрудника одного из модельных агентств, поработав в котором, Стэтхэм познакомился с режиссером Гаем Ричи, который и сделал из него звезду", "", "", " ", "Джонни Депп", "", "Джонни Депп всегда мечтал о славе, но вот быть актером он не предполагал", " С детства мальчик грезил о карьере рок-звезды", " Мама с удовольствием поддержала увлечение сына и купила ему первую гитару, ведь только музыка отвлекала 15-летнего Джонни от алкоголя и наркотиков", " Будучи тинейджером, Депп играл в группах The Kids и P, но большого успеха не снискал", " В 20 лет он женился на Лори Энн Эллисон, которая работала гримершей на киностудии", " Она-то и познакомила Джонни с Николасом Кейджем, который помог парню получить первую роль в фильме «Кошмар на улице Вязов»", " После того, как очередная музыкальная группа Деппа распалась, ему пришлось всерьез заняться актерством, чтобы обеспечить себя", "", "", " ", ""];
